[{"title":"Multimedia - Wikipedia","snippet":"Multimedia is a form of communication that uses a combination of different content forms such as text, audio, images, animations, or video into a single interactive presentation, in contrast to traditional mass media, such as printed material or audio recordings, which features little to no interaction between users. Popular examples of ...","url":"https://en.wikipedia.org/wiki/Multimedia","frequency":{}},{"title":"Multimedia Definition & Meaning - Merriam-Webster","snippet":"multimedia: [adjective] using, involving, or encompassing several media.","url":"https://www.merriam-webster.com/dictionary/multimedia","frequency":{}},{"title":"What is Multimedia? - GeeksforGeeks","snippet":"Multimedia is the presentation of text, pictures, audio, and video with links and tools that allow the user to navigate, engage, create, and communicate using a computer. Multimedia refers to the computer-assisted integration of text, drawings, still and moving images (videos) graphics, audio, animation, and any other media in which any type of ...","url":"https://www.geeksforgeeks.org/what-is-multimedia/","frequency":{}},{"title":"Multimedia Introduction - tutorialspoint.com","snippet":"Multimedia is an interactive media and provides multiple ways to represent information to the user in a powerful manner. It provides an interaction between users and digital information. It is a medium of communication.Some of the sectors where multimedias is used extensively are education, training, reference material, business presentations ...","url":"https://www.tutorialspoint.com/multimedia/multimedia_introduction.htm","frequency":{}},{"title":"Multimedia Definition with Examples - Multimedia, Photo and Video","snippet":"A multimedia device that plays music, videos and displays photos (such as a smartphone) As a noun: it’s the digital content properly speaking that combines different media types. Examples: A video clip of a song of The Beatles with Spanish subtitles: it combines video, music and text together) An YouTube live streaming of video gameplay ...","url":"https://multimediaphotoandvideo.com/multimedia-definition-with-examples/","frequency":{}},{"title":"About - Multimedia Arts","snippet":"The Multimedia faculty and program co-creators tapped into some of the worlds most highly acclaimed multimedia production studios and software companies as they fine-tuned a curriculum which focuses on five major areas: Digital Imaging, Web Design and Production, Digital Video Arts. Animation and Writing for Multimedia Programs. BCC Multimedia Arts Booklet Download a copy of Read more...","url":"https://www.berkeleycitycollege.edu/multimedia/","frequency":{}},{"title":"Using the multimedia console - AltspaceVR | Microsoft Learn","snippet":"The Multimedia Console is a tool that enables media sharing in events and worlds. You can use it to share things like images, Dlive.tv livestreams and hosted videos. Below is a step-by-step instruction on how to use the Multimedia Console. Getting started. Getting started with the Multimedia Console is a two part process.","url":"https://learn.microsoft.com/en-us/windows/mixed-reality/altspace-vr/tutorials/multimedia-console","frequency":{}},{"title":"Advantages And Disadvantages Of Multimedia - A Plus Topper","snippet":"Multimedia is a term that has been used to describe any kind of communication that consists of separate digital media. This includes text, photographs, video, and audio. Multimedia includes the 21st century’s most popular medium, the internet. Websites are able to use multimedia technologies and graphics to create attractive web pages ...","url":"https://www.aplustopper.com/advantages-and-disadvantages-of-multimedia/","frequency":{}},{"title":"Significado de Multimedia (Qué es, Concepto y Definición) - Significados","snippet":"Qué es Multimedia: Multimedia es un término que se emplea en los sistemas u objetos que se valen de diversos medios para transmitir o presentar un tipo de información combinando, de manera simultánea, textos, imágenes, audios, entre otros. La multimedia puede ser empleada en los equipos analógicos, digitales y en los dispositivos de ...","url":"https://www.significados.com/multimedia/","frequency":{}},{"title":"Multimedia Receivers | Car Entertainment | JVC","snippet":"Multimedia Receiver featuring 6.2\" WVGA Clear Resistive Touch Monitor / Bluetooth / 13-Band EQ / JVC Remote App Compatibility KW-M150BT Digital Media Receiver featuring 6.8\" WVGA Capacitive Monitor / USB Mirroring for Android Phones / Bluetooth / 13-Band EQ / Shallow Chassis See more. Accessories - Multimedia Receivers ...","url":"https://www.jvc.com/usa/car-entertainment/multimedia-receivers/","frequency":{}},{"title":"MULTIMEDIA | English meaning - Cambridge Dictionary","snippet":"multimedia definition: 1. using a combination of moving and still pictures, sound, music, and words, especially in…. Learn more.","url":"https://dictionary.cambridge.org/dictionary/english/multimedia","frequency":{}},{"title":"Multimedia Authoring Tools: Definition, Features, and Examples","snippet":"Authoring tools in multimedia, surpass normal presentation tools for interactive functions and are exported in multichannel: Video, HTML5, SCORM, and xAPI packages. They also can track and export learners’ performance results as well. That is a key summary before considering committing to a deserved authoring tool.","url":"https://atomisystems.com/elearning/multimedia-authoring-tools-definition-features-and-examples/","frequency":{}},{"title":"What is Multimedia Design? - Learn.org","snippet":"Multimedia design is the art of integrating multiple forms of media. It is used in video games, information kiosks, websites and many other interactive applications. Careers in multimedia design can be found in a growing number of industries, from Madison Avenue advertising agencies to Hollywood production companies. For information about ...","url":"https://learn.org/articles/What_is_Multimedia_Design.html","frequency":{}},{"title":"IK Multimedia. Musicians First.","snippet":"IK Multimedia - Musicians First solutions for iRig interfaces, controllers, microphones, iLoud micro monitors, UNO synth, and studio software like AmpliTube, SampleTank, T-RackS and more.","url":"https://www.ikmultimedia.com/","frequency":{}},{"title":"Home | Aurora Multimedia Corp","snippet":"Aurora makes the most innovative and advanced products in the AV industry. Our products include 10G and 1G AV over IP transceivers, TAVIS temperature check tablets, ReAX control processors and touch panels, HDBaseT solutions, and much more.","url":"https://auroramultimedia.com/","frequency":{}},{"title":"What Is a Multimedia Designer? (And How To Become One)","snippet":"What is multimedia design? Multimedia design is the art of integrating different media, including text, images, audio and video to communicate with an audience. The practice is a niche in the graphics and website design industry and used in other industries such as: Advertising. Marketing.","url":"https://www.indeed.com/career-advice/finding-a-job/multimedia-designing","frequency":{}},{"title":"Multimedia Tutorial - tutorialspoint.com","snippet":"Multimedia Tutorial. PDF Version. Quick Guide. Resources. Multimedia is an interactive media and provides multiple ways to represent information to the user in a powerful manner. This tutorial gives a complete understanding on Multimedia starting from basic overview till its advanced imaging/audio/video coding technologies.","url":"https://www.tutorialspoint.com/multimedia/index.htm","frequency":{}},{"title":"MULTIMEDIA Synonyms: 3 Synonyms & Antonyms for MULTIMEDIA | Thesaurus.com","snippet":"Find 3 ways to say MULTIMEDIA, along with antonyms, related words, and example sentences at Thesaurus.com, the world's most trusted free thesaurus.","url":"https://www.thesaurus.com/browse/multimedia","frequency":{}},{"title":"Multimedia Specialist Salary in San Francisco, CA","snippet":"Multimedia Specialist. Career Path Resume Keywords Salary Jobs Multimedia Specialist Salary in San Francisco, CA. Yearly. Yearly; Monthly; Weekly; Hourly; Table View. $32,345 - $39,275 10% of jobs $46,207 is the 25th percentile. Salaries below this are outliers. $39,276 - $46,207 13% of ...","url":"https://www.ziprecruiter.com/Salaries/Multimedia-Specialist-Salary-in-San-Francisco,CA","frequency":{}},{"title":"Multimedia Specialist Salary in San Francisco, California","snippet":"The average Multimedia Specialist salary in San Francisco, California is $63,054 as of June 28, 2022, but the salary range typically falls between $60,423 and $65,777.","url":"https://www.salary.com/research/salary/posting/multimedia-specialist-salary/san-francisco-ca","frequency":{}},{"title":"Multimedia | Terra","snippet":"Multimedia. Terra continues to witness many changes on the landscape, collecting some of the most iconic images of our planet since its launch in December of 1999. Many sources archived Terra imagery including the Earth Observatory and NASA’s Visible Earth. This section contains images, videos and podcasts that visualize many events and ...","url":"https://terra.nasa.gov/multimedia","frequency":{}},{"title":"Multimedia | NASA","snippet":"NASA.gov brings you the latest images, videos and news from America's space agency. Get the latest updates on NASA missions, watch NASA TV live, and learn about our quest to reveal the unknown and benefit all humankind.","url":"https://www.nasa.gov/multimedia/index.html","frequency":{}},{"title":"Components of Multimedia - Multimedia and Desktop Publishing - BrainKart","snippet":"Multimedia has five major components like text, images, sound, video and animation. They are explained in detail below: 1. Text. Text is the basic components of multimedia and most common ways of communicating information to other person. Even though multimedia includes images, video, audio and graphics, Text is the basic components used in ...","url":"https://www.brainkart.com/article/Components-of-Multimedia_37403/","frequency":{}},{"title":"13 Multimedia Careers for the Creative Individual | Indeed.com","snippet":"Multimedia is the act of using more than one art form or media format to create something like an advertisement, slideshow presentation, video game, training or interactive touch screen. Someone who has a career in multimedia may use any combination of visual effects, audio, video, graphic design, text or animation in their work, and the ...","url":"https://www.indeed.com/career-advice/finding-a-job/multimedia-careers","frequency":{}},{"title":"24 Types of Jobs in Multimedia | Indeed.com - Indeed Career Guide","snippet":"Multimedia is a growing field with a range of opportunities for creative professionals. Jobs in this field allow you to use your technical skills and artistic passion to work on exciting projects. In this article, we discuss what jobs in multimedia are, the career outlook, salary and workplace environment for careers and multimedia and ...","url":"https://www.indeed.com/career-advice/finding-a-job/jobs-in-multimedia","frequency":{}},{"title":"8 Best Multimedia Monitors in 2022 - fixthephoto.com","snippet":"Top 8 Multimedia Monitors. Deco Gear DGVIEW201 - Our choice. Samsung CRG9 - The best curved multimedia monitor. Dell S-Series - Cheap. Samsung CH890 - The best Samsung for watching movies. LG 27UK650 - 4K multimedia monitor. Samsung C27HG70 - 1140p multimedia monitor. Sceptre C345W-2560UN - Frameless monitor.","url":"https://fixthephoto.com/best-multimedia-monitor.html","frequency":{}},{"title":"Multimedia < Portland Community College","snippet":"Multimedia projects include those focused on business, marketing, education, training, presentations, and entertainment applications. The program is located at the Cascade Campus. The 100 level multimedia courses are generally offered each term and students begin taking classes during any term. A variety of advanced, 200 level courses are also ...","url":"https://catalog.pcc.edu/programsanddisciplines/multimedia/","frequency":{}},{"title":"Multimedia Technology - Allegany College of Maryland","snippet":"Multimedia Technology 217 (Page Layout and Desktop Publishing) 3: Social and Behavioral Science Elective: 3: Total: 15: Total Credit Hours: 60: 1 English Composition Elective includes: 102, 112 or 251 (Consult your advisor or Advising Center staff for appropriate courses.) NOTE: All courses specifically identified by course number are ...","url":"https://catalog.allegany.edu/current/programs/multimedia-technology.html","frequency":{}},{"title":"Multimedia Class Scheduler Service - Win32 apps | Microsoft Learn","snippet":"In this article. The Multimedia Class Scheduler service (MMCSS) enables multimedia applications to ensure that their time-sensitive processing receives prioritized access to CPU resources. This service enables multimedia applications to utilize as much of the CPU as possible without denying CPU resources to lower-priority applications.","url":"https://learn.microsoft.com/en-us/windows/win32/procthread/multimedia-class-scheduler-service","frequency":{}},{"title":"Multimedia - Learning Management System","snippet":"Add multimedia content such as images and videos to course content pages, quizzes, and assignments; Embed and link files through the Rich Content Editor (Canvas) Learning. Designate a space for students to create, collaborate, and organize files and folders;","url":"https://lms.tamu.edu/Menu/Multimedia","frequency":{}},{"title":"Multimedia PC Specifications - Win32 apps | Microsoft Learn","snippet":"The Multimedia PC (MPC) Marketing Council has developed two specifications to encourage the adoption of multimedia capabilities. The Level 1 specification, developed in 1990, provides a baseline definition of multimedia computing in functionality, hardware components, and software components. The Level 2 specification, issued in 1993, builds on ...","url":"https://learn.microsoft.com/en-us/windows/win32/multimedia/multimedia-pc-specifications","frequency":{}},{"title":"Multimedia Job Description | Velvet Jobs","snippet":"At least 1 year of experience in the area of designing print materials such as posters, brochures, catalogues, is a must. Over 5 years experience in agency and/or video/film/broadcast production. Demonstrated strengths in impacting and influencing stakeholders. 2. Multimedia Job Description.","url":"https://www.velvetjobs.com/job-descriptions/multimedia","frequency":{}},{"title":"Uses and Importance of Multimedia - QS Study","snippet":"Uses and Importance of Multimedia. Multimedia is a computer based synchronized system that includes text, audio, video, animation, graphics, interactive computing etc. It’s an amazing invention of modern communication technology. It enhances the utility of computer to the general people by enriching business, education, entertainment ...","url":"https://qsstudy.com/uses-importance-multimedia/","frequency":{}},{"title":"MULTIMEDIA | definition in the Cambridge English Dictionary","snippet":"multimedia meaning: 1. using a combination of moving and still pictures, sound, music, and words, especially in…. Learn more.","url":"https://dictionary.cambridge.org/us/dictionary/english/multimedia","frequency":{}},{"title":"Multimedia Systems - an overview | ScienceDirect Topics","snippet":"Multimedia systems have become useful tools for users because multimedia applications can make an endless range of easy-to-comprehend information available to them. Various multimedia applications have been developed and used in wide areas. The major functions multimedia systems provided to users include areas such as: •. Education and training.","url":"https://www.sciencedirect.com/topics/computer-science/multimedia-systems","frequency":{}},{"title":"Multimedia: It's Components and Applications - Library & Information ...","snippet":"Multimedia is the field concerned with the computer-controlled integration of the text, graphics, drawings, still and moving images (Video), animations, audio, etc., where all kinds of information could be represented, stored, transmitted and processed digitally. Components of Multimedia: i) Text: It may be an easy content type to forget when ...","url":"https://www.lisedunetwork.com/multimedia-its-components-and-applications/","frequency":{}},{"title":"Multimedia Project Honoring Native American History and Culture in New ...","snippet":"The multimedia project was the culmination of a five-year effort by Bakshi, Turtle Clan members, Department of Landscape Architecture researchers along with other partners. The project began with a design studio teaching collaboration in 2018 and continued with funding from the NJCH through three separate grants. The focus of the research was ...","url":"https://sebsnjaesnews.rutgers.edu/2022/11/multimedia-project-honoring-native-american-history-and-culture-in-new-jersey-wins-public-humanities-award/","frequency":{}},{"title":"HSC - Multimedia Majors Band 6 - Tempe High School","snippet":"Band 6 Misha Cajic 2015. English Rein 25480163. Watch on. Band 6 Yeung Cheng, InTech Nominee 2014. Band 6 2012 Industrial Technology - Multimedia student Banson Tong. Watch on. Band 6 \"It's Just a Game\" Banson Tong 2013. Band 6 2012 Industrial Technology - Multimedia student Anish. Watch on.","url":"https://tempe-h.schools.nsw.gov.au/learning-at-our-school/technology-and-applied-studies1/school-promos/multimedia.html","frequency":{}},{"title":"Phonetics: Black American English –[Multimedia-English]","snippet":"The way black American people pronounce the R is basically the same as in BrE, that is, they only pronounce the R when it is followed by a vowel. sorry BrE, Black English and rest of AmE /sɒrɪ/. teacher BrE & Black English /ti:tʃə/, standard AmE /ti:tʃər/. FINAL SCHWA / ə /. A final Schwa is pronounced very very weak in both BrE and AmE ...","url":"https://multimedia-english.com/phonetics/black-american-english","frequency":{}},{"title":"Optica hiring Multimedia Designer in Washington, District of Columbia ...","snippet":"The Multimedia Designer is an innovator and expert on emerging design trends and the technologies required to implement them. Primary Responsibilities Product and Programs Support (80%)","url":"https://www.linkedin.com/jobs/view/multimedia-designer-at-optica-3320754317","frequency":{}},{"title":"Multimedia Designer [Graphic Design / Photoshooting / Video Edit /Web ...","snippet":"Candidate should preferably possess at least a Diploma, Bachelor Degree, Post Graduate Diploma or Professional Certification in Multimedia or UI; Proficient in the application of Adobe design suites (Indesign, Illustrator, After Effect, XD, Captivate, Animate, Premier Pro etc.)","url":"https://sg.linkedin.com/jobs/view/multimedia-designer-graphic-design-photoshooting-video-edit-web-design-5-days-bras-basah-1118-at-the-supreme-hr-advisory-pte-ltd-3324316637","frequency":{}},{"title":"W Hong Kong hiring Multimedia Designer in Hong Kong, Hong Kong SAR ...","snippet":"We offer promising career opportunities and excellent remuneration packages. Interested parties may apply by sending your full resume to our Assistant Director of Human Resources, W Hong Kong, 1 Austin Road West, Kowloon Station, Kowloon, Hong Kong or fax to 3717 2756 or email to [email redacted, apply via Company website].","url":"https://hk.linkedin.com/jobs/view/multimedia-designer-at-w-hong-kong-3322675245","frequency":{}},{"title":"Nagha-hire ang Beauty Republic PH ng Multimedia Artist sa Taguig ...","snippet":"Our office is looking for an experienced, driven and self-motivated Multimedia Artist who is responsible for covering key corporate events by taking photographs and videos that would be used in marketing and campaign materials for websites, social media, and marketing collaterals. The successful candidate should organize all digital resources ...","url":"https://ph.linkedin.com/jobs/view/multimedia-artist-at-beauty-republic-ph-3326841738","frequency":{}},{"title":"MULTIMEDIA JOURNALIST - WSAW Job in Wausau, WI - Gray Television ...","snippet":"WSAW-TV, the CBS/FOX/CW affiliate in Wausau, WI is looking for a full-time multimedia journalist who is ready to join our award-winning news operation and work in a new studio featuring the latest technology. Duties include shooting and gathering information in the field as part of a team, and independently. This person will also assist with ...","url":"https://www.careerbuilder.com/job/J3M2J1647XC3MWR83J9","frequency":{}},{"title":"Rifa EN VIVO! 🎁 Regalando un bundle T-RackS 5 SE de IK MULTIMEDIA a un ...","snippet":"Quieres participar? Entrale antes de las 7 am de hoy Jueves 24 de Noviembre del 2022. Info: https://youtu.be/swZqa_2bvDEBases:Regalando un pack completo de T...","url":"https://www.youtube.com/watch?v=LXl_OTCcoN0","frequency":{}},{"title":"How China built the world’s largest high-speed rail network","snippet":"By Published November 24, 2022. China's first high-speed railway started operating in 2008 between Beijing and Tianjin. Since then, the country has built a network that spans nearly 40,000km (25,000 miles) and is now the world’s largest for bullet trains that can travel up to 350km/h (220mph). The network is getting bigger, with plans to ...","url":"https://multimedia.scmp.com/infographics/news/china/article/3200811/high-speed-railway/index.html","frequency":{}},{"title":"Retail Insights hiring Multimedia designer at Retail Insights in London ...","snippet":"Multimedia designer at Retail Insights. Retail Insights London, England, United Kingdom 3 weeks ago Be among the first 25 applicants See who Retail Insights has hired for this role No longer accepting applications. Report this company Package: £25,000 - £32,000 (depending on experience) ...","url":"https://uk.linkedin.com/jobs/view/multimedia-designer-at-retail-insights-at-retail-insights-3330549752","frequency":{}},{"title":"Nexstar Media Group, Inc Reporter I, MultiMedia Journalist Job in ...","snippet":"The Multimedia Journalist Reporter produces, reports, shoots, writes, voices, edits and feeds news production content for all platforms in a manner that is clear, engaging and meaningful to news consumers. Reports news stories for broadcast, describing the background and details of events. Arranges interviews with people who can provide ...","url":"https://www.glassdoor.com/job-listing/reporter-i-multimedia-journalist-nexstar-media-group-JV_IC1145845_KO0,32_KE33,52.htm?jl=1008213267918","frequency":{}},{"title":"(Multimedia) China lanza cohete comercial CERES-1 Y4 con cinco satélites","snippet":"JIUQUAN, 16 nov (Xinhua) -- China lanzó hoy miércoles con éxito un cohete portador CERES-1 Y4 y llevó un grupo de satélites comerciales al espacio. El cohete despegó a las 14:20 (hora de ...","url":"https://www.msn.com/es-xl/noticias/otras/multimedia-china-lanza-cohete-comercial-ceres-1-y4-con-cinco-sat%C3%A9lites/ar-AA14aLML","frequency":{}},{"title":"تقوم شركة Starcom بالتوظيف لوظيفة Multimedia Designer - MAF Holding في ...","snippet":"Designing it usually involves brainstorming sessions with other multimedia designers to decide upon the creative direction of a given project. Use Computer Programs to Create Animation, Audio, and Visual Effects Multimedia designers spend most of their time using the tools found in the Adobe Creative Suite.","url":"https://lb.linkedin.com/jobs/view/multimedia-designer-maf-holding-at-starcom-3319649552","frequency":{}},{"title":"STAGE - Assistant(e) Communication multimédia - LILLE H/F","snippet":"Le service de la Communication, composé de 5 personnes, est à la recherche de son –sa futur-e stagiaire. En rejoignant l'équipe de la Communication et sous la responsabilité du Délégué à la communication, tu contribueras à l'élaboration, au pilotage et à la mise en œuvre du plan de communication régional ainsi qu'au développement de notre présence sur les supports numériques.","url":"https://gl.linkedin.com/jobs/view/stage-assistant-e-communication-multim%C3%A9dia-lille-h-f-at-france-t%C3%A9l%C3%A9visions-3343625942","frequency":{}},{"title":"Manikandan D - Senior Multimedia Designer - Newgen KnowledgeWorks Pvt ...","snippet":"Senior Multimedia Designer. Newgen KnowledgeWorks Pvt Ltd. Jul 2016 - Present6 years 5 months. Chennai, Tamil Nadu, India. HTML 5, CSS 3, STORYLINE 360, ISPRING POWERPOINT, PEARSON MULTIMEDIA DIGITAL.","url":"https://in.linkedin.com/in/manikandan-d-153b4b65","frequency":{}},{"title":"UX Manager - Financial Services - Consulting - Manager","snippet":"Free design/web/multimedia job search site: UX Manager - Financial Services - Consulting - Manager job in Charlotte North Carolina, USA. Find job postings in CA, NY, NYC, NJ, TX, FL, MI, OH, IL, PA, GA, MA, WA, UT, CO, AZ, SF Bay Area, LA County, USA, UAE, SA, North America, abroad. Post design/web/multimedia jobs for free; apply online for IT ...","url":"https://www.learn4good.com/jobs/charlotte/north-carolina/design_and_multimedia/1656692647/e/","frequency":{}},{"title":"VCO Agencia de Marca busca personas para el cargo de Multimedia ...","snippet":"Estamos buscando Diseñadores Multimedia y gráficos que se sumen al equipo creativo de VCO. Con experiencia y afinidad en: * Animación, producción y post producción (After Effects, Premiere) * Habilidades en manejo de cámaras, luces y equipo de producción * Diseño gráfico y creatividad * Conocimientos en creación de contenidos ...","url":"https://ec.linkedin.com/jobs/view/multimedia-designer-at-vco-agencia-de-marca-3323055786","frequency":{}},{"title":"Race Radio - Multimedia Showcase - Horse Racing - The Hong Kong Jockey Club","snippet":"Centenary Sprint Cup. Citi Hong Kong Gold Cup. Queen's Silver Jubilee Cup. Standard Chartered Champions & Chater Cup. G2 & G3 Races. World's Best Jockey Rankings. World's Best Racehorse Rankings. Annual World Rankings 2021. World’s Top Group 1 Races.","url":"https://racing.hkjc.com/racing/english/showcase/live.asp","frequency":{}},{"title":"Jérôme Bonaparte - Wikimedia Commons","snippet":"Jérôme Bonaparte. Porträtt av Jérôme Bonaparte som kung av Westfalen. Porträtt av François Gérard. English: Jérôme Bonaparte (1784-1860), youngest brother of Napoléon Bonaparte, King of Westphalia (1807-1813). Deutsch: Jérôme Bonaparte (1784-1860), jüngster Bruder von Napoléon Bonaparte, König von Westphalen (1807-1813).","url":"https://commons.wikimedia.org/wiki/J%C3%A9r%C3%B4me_Bonaparte","frequency":{}}]